cf/Catalogs/JobsQueueHandlers.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>JobsQueueHandlers</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Use</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Schedule</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JobsCount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JobDuration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Auto</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Methods</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Method</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/JobsQueueHandlers/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then
	
#Region Internal
	
// Returns:
// 	JobSchedule
//
Function DefaultSchedule() Export
	
	Schedule = New JobSchedule;
	Schedule.DaysRepeatPeriod = 1;
	Schedule.RepeatPeriodInDay = 60;
	
	Return Schedule;
	
EndFunction

// Update handler
//
Procedure TransferDataFromRoutineTask() Export
	
	Filter = New Structure("Metadata", Metadata.ScheduledJobs.DeleteJobsQueueProcessingCTL);
	FoundJobs = ScheduledJobs.GetScheduledJobs(Filter);
	For Each Job In FoundJobs Do
		Ref = Catalogs.JobsQueueHandlers.GetRef(New UUID(Job.Key));
		TaskQueueHandler = Ref.GetObject();
		If TaskQueueHandler <> Undefined Then
			TaskQueueHandler.Use = Job.Use;
			TaskQueueHandler.Schedule = New ValueStorage(Job.Schedule);
			TaskQueueHandler.DataExchange.Load = True;
			TaskQueueHandler.Write();
		EndIf;
		Job.Delete();
	EndDo;
	
EndProcedure

#EndRegion
	
#EndIf
